windAroundBuildings_CFDHAM_veg/0/air/cloudCover
(			
(	0	0	)
(	3600	0	)
(	7200	0	)
(	10800	0	)
(	14400	0	)
(	18000	0	)
(	21600	0	)
(	25200	0	)
(	28800	0	)
(	32400	0	)
(	36000	0	)
(	39600	0.1	)
(	43200	0.2	)
(	46800	0.3	)
(	50400	0.3	)
(	54000	0.3	)
(	57600	0.3	)
(	61200	0.3	)
(	64800	0.3	)
(	68400	0.3	)
(	72000	0.3	)
(	75600	0.3	)
(	79200	0.3	)
(	82800	0.3	)
(	86400	0.3	)
)			

