windAroundBuildings_CFDHAM_veg/0/air/gcr
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/air";
    object      gcr;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    west
    {
        type            fixedValue;
        value           uniform 0;
    }
    east
    {
        type            fixedValue;
        value           uniform 0;
    }
    top
    {
        type            slip;
    }
    ground
    {
        type            fixedValue;
        value           uniform 0;
    }
    north
    {
        type            slip;
    }
    south
    {
        type            slip;
    }
    buildings
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
