windAroundBuildings_CFDHAM_veg/0/air/include/epsilon_bc_air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type turbulentMixingLengthDissipationRateInlet;
mixingLength    10.0;   
value           uniform 0.001;

// ************************************************************************* //
